nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/driver_examples/pwm/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOD6 (number 9), U14C[9]/TXD_BDM
  @{ */
#define BOARD_TXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_TXD_BDM_PIN 6U              /*!<@brief GPIOD pin index: 6 */
#define BOARD_TXD_BDM_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOD5 (number 10), U13[3]/RXD_BDM
  @{ */
#define BOARD_RXD_BDM_GPIO GPIOD          /*!<@brief GPIO device name: GPIOD */
#define BOARD_RXD_BDM_PIN 5U              /*!<@brief GPIOD pin index: 5 */
#define BOARD_RXD_BDM_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOE1 (number 69), J3[15]/U3B[3]/GE1/PWMA_0A/LED1
  @{ */
#define BOARD_PWM_LED1_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED1_PIN 1U              /*!<@brief GPIOE pin index: 1 */
#define BOARD_PWM_LED1_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE3 (number 75), J3[11]/GE3/PWMA_1A
  @{ */
#define BOARD_PWM_LED3_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED3_PIN 3U              /*!<@brief GPIOE pin index: 3 */
#define BOARD_PWM_LED3_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE5 (number 83), J3[7]/GE5/PWMA_2A
  @{ */
#define BOARD_PWM_LED5_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED5_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define BOARD_PWM_LED5_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE0 (number 68), J3[13]/U3A[1]/GE0/PWMA_0B/LED0
  @{ */
#define BOARD_PWM_LED0_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWM_LED0_PIN 0U              /*!<@brief GPIOE pin index: 0 */
#define BOARD_PWM_LED0_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE8 (number 72), J1[16]/GE8/PWMB_2B
  @{ */
#define BOARD_PWMB_2B_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_PWMB_2B_PIN 8U              /*!<@brief GPIOE pin index: 8 */
#define BOARD_PWMB_2B_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
